In [2]:
import numpy as np
import pandas as pd

In [3]:
x = pd.Series([10, 20, 30, 40, 50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
x.dtype

dtype('int64')

In [6]:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [7]:
data = [450, 650, 870]
index = ["2010", "2011", "2012"]
sales = pd.Series(data, index=index)
sales.index.name = "Year"
sales

Year
2010    450
2011    650
2012    870
dtype: int64

In [8]:
sales.index

Index(['2010', '2011', '2012'], dtype='object', name='Year')

In [9]:
sales["2010"]

450

In [10]:
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]
df = pd.DataFrame(data, columns=["Name", "Age"])

In [11]:
list_dicts = [
    {"Name": "Tom", "Sales": 300},
    {"Name": "Greg"},
    {"Name": "Paula", "Sales": 542, "Performacne": "Outstanding"},
]

df_list_dicts = pd.DataFrame(list_dicts)
df_list_dicts

    Name  Sales  Performacne
0    Tom  300.0          NaN
1   Greg    NaN          NaN
2  Paula  542.0  Outstanding

In [12]:
df_list_dicts["Grade"] = ["A", "A", "B"]
df_list_dicts

    Name  Sales  Performacne Grade
0    Tom  300.0          NaN     A
1   Greg    NaN          NaN     A
2  Paula  542.0  Outstanding     B

In [16]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])
df_region = pd.DataFrame({'East':east, 'West': west})
df_region['North'] = [2000,3000,2500,4000]
df_region['South'] = [1500,2000,1500,4000]

In [17]:
df_region["years"] = ["2016", "2017", "2018", "2019"]
df_region

      East  West  North  South years
Q1  1000.0  1100   2000   1500  2016
Q2  1200.0  1300   3000   2000  2017
Q3  3400.0  2400   2500   1500  2018
Q4     NaN  3500   4000   4000  2019

In [18]:
df_region.set_index("years", inplace=True)

In [19]:
df_region

         East  West  North  South
years
2016   1000.0  1100   2000   1500
2017   1200.0  1300   3000   2000
2018   3400.0  2400   2500   1500
2019      NaN  3500   4000   4000

In [20]:
new_region = df_region.reindex(["2018", "2019", "2020", "2021"])
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN

In [21]:
re_indexed = new_region.reindex(columns=["North", "South", "New"])
re_indexed

        North   South  New
years
2018   2500.0  1500.0  NaN
2019   4000.0  4000.0  NaN
2020      NaN     NaN  NaN
2021      NaN     NaN  NaN

Missing Data

In [22]:
re_indexed.fillna(0)

        North   South  New
years
2018   2500.0  1500.0  0.0
2019   4000.0  4000.0  0.0
2020      0.0     0.0  0.0
2021      0.0     0.0  0.0

In [23]:
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN

In [24]:
new_region.fillna(method="ffill")

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019   3400.0  3500.0  4000.0  4000.0
2020   3400.0  3500.0  4000.0  4000.0
2021   3400.0  3500.0  4000.0  4000.0

In [25]:
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN

In [26]:
new_region.loc["2022"] = [6400, 7400, 5200, 800]
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN
2022   6400.0  7400.0  5200.0   800.0

In [27]:
new_region.interpolate()

         East    West   North        South
years
2018   3400.0  2400.0  2500.0  1500.000000
2019   4150.0  3500.0  4000.0  4000.000000
2020   4900.0  4800.0  4400.0  2933.333333
2021   5650.0  6100.0  4800.0  1866.666667
2022   6400.0  7400.0  5200.0   800.000000

In [28]:
new_region

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2021      NaN     NaN     NaN     NaN
2022   6400.0  7400.0  5200.0   800.0

In [29]:
new_region.dropna()

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2022   6400.0  7400.0  5200.0   800.0

In [30]:
new_region.dropna(axis=1, thresh=3)

         West   North   South
years
2018   2400.0  2500.0  1500.0
2019   3500.0  4000.0  4000.0
2020      NaN     NaN     NaN
2021      NaN     NaN     NaN
2022   7400.0  5200.0   800.0

In [31]:
new_region.sort_index(ascending=False).duplicated()

years
2022    False
2021    False
2020     True
2019    False
2018    False
dtype: bool

In [32]:
new_region.drop_duplicates()

         East    West   North   South
years
2018   3400.0  2400.0  2500.0  1500.0
2019      NaN  3500.0  4000.0  4000.0
2020      NaN     NaN     NaN     NaN
2022   6400.0  7400.0  5200.0   800.0

In [33]:
new_region.West

years
2018    2400.0
2019    3500.0
2020       NaN
2021       NaN
2022    7400.0
Name: West, dtype: float64

In [34]:
new_region["West"]

years
2018    2400.0
2019    3500.0
2020       NaN
2021       NaN
2022    7400.0
Name: West, dtype: float64

In [36]:
new_region[["West", "East"]]

         West    East
years
2018   2400.0  3400.0
2019   3500.0     NaN
2020      NaN     NaN
2021      NaN     NaN
2022   7400.0  6400.0

In [37]:
new_region.loc["2022"]

East     6400.0
West     7400.0
North    5200.0
South     800.0
Name: 2022, dtype: float64

In [38]:
new_region.iloc[1,2]

4000.0

In [39]:
new_region["East"] + new_region["South"]

years
2018    4900.0
2019       NaN
2020       NaN
2021       NaN
2022    7200.0
dtype: float64

In [40]:
new_region["East"].add(new_region["South"], fill_value=0)

years
2018    4900.0
2019    4000.0
2020       NaN
2021       NaN
2022    7200.0
dtype: float64

In [41]:
new_region["South"].rank(ascending=0)

years
2018    2.0
2019    1.0
2020    NaN
2021    NaN
2022    3.0
Name: South, dtype: float64